20231231131429-assignment_operators.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Assignment Operators</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Assignment Operators</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9bc8220">1. Assignment Operators</a>
<ul>
<li><a href="#org4cd3fa0">1.1. Note</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9bc8220" class="outline-2">
<h2 id="org9bc8220"><span class="section-number-2">1.</span> Assignment Operators</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="20231231060610-binary_operators.html#ID-9bcf2aef-060a-4011-98b5-cb949a9f7d1a">Binary Operator</a> that <b>modifies</b>, or <b>assigns</b>, the variable on the <code>LHS</code> of the operator with the result of the value on the <code>RHS</code>.
</p>

<p>
<code>variable = expression;</code>
</p>

<p>
An <b>expression</b> represents a computation involving <code>values</code>, <code>variables</code>, and <code>operators</code> that, taking them together, evaluates to a <b>value</b>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-type">int</span> <span class="org-variable-name">y</span> = 1; <span class="org-comment-delimiter">// </span><span class="org-comment">Assign 1 to variable Y
</span><span class="org-type">double</span> <span class="org-variable-name">radius</span> = 1.0; <span class="org-comment-delimiter">// </span><span class="org-comment">Assign 1.0 to variable radius
</span><span class="org-type">int</span> <span class="org-variable-name">x</span> = 5 * (3 / 2); <span class="org-comment-delimiter">// </span><span class="org-comment">Assign the value of the expression to X
</span>x = y + 1; <span class="org-comment-delimiter">// </span><span class="org-comment">Assign the addition of y and 1 to x
</span><span class="org-type">double</span> <span class="org-variable-name">area</span> = radius * radius * 3.14159; <span class="org-comment-delimiter">// </span><span class="org-comment">Compute area</span>
</pre>
</div>

<p>
Unlike most other Java operators, the assignment operator is <b>evaluated</b> from <code>right to left</code>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-type">int</span> <span class="org-variable-name">herd</span> = 1;
</pre>
</div>

<p>
You can use a variable in an expression. A variable can also be used in both sides of the <code>=</code> <b>operator</b>.
For example: <code>x = x + 1;</code>
</p>

<p>
In this <b>assignment</b> statement, the result of <code>x + 1</code> is <b>assigned</b> to <code>x</code>.
</p>

<p>
If <code>x</code> is <code>1</code> before the statement is <b>executed</b>, then it becomes <code>2</code> after the statement is <b>executed</b>.
</p>

<p>
To <b>assign</b> a <code>value</code> to a <code>variable</code>, you must place the <code>variable</code> name to the left of the assignment operator.
Thus, the following statement is wrong: <code>1 = x; // Wrong</code>
</p>

<p>
An <b>assignment</b> <b>statement</b> is essentially an <b>expression</b> that evaluates to the value to be assigned to the variable on the <code>LHS</code> of the <b>assignment</b> <b>operator</b>.
For this reason, an <b>assignment</b> <b>statement</b> is also known as an <b>assignment</b> <b>expression</b>.
</p>

<p>
For example, the following statement is correct:
<code>System.out.println(x = 1);</code>
</p>

<p>
Which is equivalent to:
</p>
<div class="org-src-container">
<pre class="src src-java">x = 1;
System.out.println(x);
</pre>
</div>

<p>
If a <code>value</code> is <b>assigned</b> to multiple <code>variables</code>, you can use chained assignments like this:
<code>i = j = k = 1;</code>
which is equivalent to:
</p>
<div class="org-src-container">
<pre class="src src-java">k = 1;
j = k;
i = j;
</pre>
</div>
</div>

<div id="outline-container-org4cd3fa0" class="outline-3">
<h3 id="org4cd3fa0"><span class="section-number-3">1.1.</span> Note</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In an <b>assignment</b> <b>statement</b>, the <b>data</b> <b>type</b> of the <code>variable</code> on the <b>left</b> must be compatible with the data type of the <b>value</b> on the right.
For example, <code>int x = 1.0</code> would be illegal, because the data type of <code>x</code> is <code>int</code>.
</p>

<p>
You cannot assign a <code>double</code> value (<code>1.0</code>) to an <code>int</code> variable without using <a href="20231224190739-widening_primitive_conversion.html#ID-3ef23225-ae37-428e-8ad3-5d7728f59478">Type Casting</a>.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
